In [2]:
import pandas as pd
import numpy as np

In [12]:
df = pd.read_json(
    "C:\\Users\\Lenovo\\Desktop\\Тест\\Занятие по pandas\\1 занятие\\pandas\\data\\auto_remix.json"
)

In [13]:
pd.options.display.float_format = '{:,.2f}'.format

In [24]:
sample = df.sample(n=200, replace=True, random_state=21)

In [27]:
sample['Refund'] = np.random.permutation(sample['Refund'])
sample['Fines'] = np.random.permutation(sample['Fines'])

In [32]:
car_rows = pd.concat([df, sample])

In [86]:
np.random.seed(42)

In [87]:
car_rows['Year'] = np.random.randint(low=1980, high=2021, size = len(car_rows))

In [ ]:
surname = pd.read_json(
    "C:\\Users\\Lenovo\\Desktop\\Тест\\Занятие по pandas\\1 занятие\\pandas\\data\\surname.json"
)

In [92]:
surname = pd.DataFrame(surname)

In [106]:
surname.columns = ['NAME', 'COUNT', 'RANK']

In [112]:
surname.drop(index = 0,inplace = True)

In [116]:
surname.sort_values('COUNT',ascending = False)

         NAME    COUNT RANK
49      LOPEZ   874523   12
28   GONZALEZ   841025   13
97     WILSON   801882   14
4    ANDERSON   784404   15
88     THOMAS   756142   16
..        ...      ...  ...
53     MILLER  1161437    7
20      DAVIS  1116357    8
78  RODRIGUEZ  1094924    9
51   MARTINEZ  1060159   10
34  HERNANDEZ  1043281   11

[100 rows x 3 columns]

In [130]:
car_uniq = df['CarNumber'].unique()

In [135]:
name = surname['NAME']

In [136]:
name = name.sample(n = len(car_uniq),replace = True, random_state=21)

In [ ]:
new_df =